In [1]:
import pandas as pd
import numpy as np

In [2]:
#read the csv file into the DataFrame
df = pd.read_csv("salesdata.csv")
df.head()

    Region  Manager   SalesMan          Item  Units  Unit_price  Sale_amt
0     East   Martha  Alexander    Television     95      1198.0  113810.0
1  Central  Hermann     Shelli  Home Theater     50       500.0   25000.0
2  Central  Hermann       Luis    Television     36      1198.0   43128.0
3  Central  Timothy      David    Cell Phone     27       225.0    6075.0
4     West  Timothy    Stephen    Television     56      1198.0   67088.0

In [4]:
#find the item wise unit sold.
pd.pivot_table(df,index=['Item' ],values=['Units',],aggfunc=[np.sum])

C:\Users\HP\AppData\Local\Temp\ipykernel_15516\879951391.py:2: FutureWarning: The provided callable <function sum at 0x000001E43715FEC0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(df,index=['Item' ],values=['Units',],aggfunc=[np.sum])

               sum
             Units
Item
Cell Phone     278
Desk            10
Home Theater   722
Television     716
Video Games    395